Tekla Open API Reference for Tekla Structures 2025
BentPlate.BendShape Enumeration
 Enumerator to define different possibilities for bend shapes.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BendShape
Public Enumeration BendShape
Members
Member name | Value | Description
Cylindrical | 0 |  Cylindrical bend.
Conical | 1 |  Conical bend.
See Also
Reference
Tekla.Structures.Model Namespace